while True:
    #Просимо користувача ввести два числа
    number1 = float(input("Введіть перше число: "))
    number2 = float(input("Введіть друге число: "))
    do = input("Оберіть математичну дію: ") #Просимо ввести математичну дію, яка буде здійснюватись над двома числами
    if do == "+": #Якщо додавання
        result = number1 + number2
        print("Результат: ", result)
    elif do == "-": #Віднімання
            result = number1 - number2
            print("Результат: ", result)
    elif do == "*": #Множення
        result = number1 * number2
        print("Результат: ", result)
    elif do == "/": #Ділення
        if number2 != 0: #Перевірка чи дорівнює друге введене число нулю
            result = number1 / number2 #Якщо друге число не нуль, то виконуємо ділення та виводимо результат
            print("Результат: ", result)
        else: #Якщо друге  число нуль, то виводиться повідомлення про неможливість ділення на нуль
            print("Ділення на нуль неможливе.")
    continue_do = input("Чи хочете продовжити розрахунки? Введіть y/n: ")
    if continue_do not in ['y', 'yes']:
        print("Завершення розрахунків.")
        break