seconds = int(input("Введіть число: "))
days = seconds // (24 * 60 * 60)  # Рахуємо кількість днів
seconds %= (24 * 60 * 60)  # Знаходимо залишок секунд після обчислення кількості днів
hours = seconds // (60 * 60)  # Рахуємо кількість годин
seconds %= (60 * 60)  # Знаходимо залишок секунд після обчислення кількості годин
minutes = seconds // 60  # Рахуємо кількість хвилин
seconds %= 60  # Знаходимо залишок секунд після обчислення кількості хвилин

day_word = "день" if days == 1 else "дні" if 2 <= days <= 4 else "днів" #Підбираємо слово "день" на основі кількості днів що ми порахували
#Формуємо результат з додаванням нулей при одноцифрових значеннях
result = f"{days} {day_word}, {str(hours).zfill(2)}:{str(minutes).zfill(2)}:{str(seconds).zfill(2)}"
print("Результат:", result)